[
  {
    "id": "20251015_cosplay_ironman",
    "title": "Cosplay - Iron Man helmet",
    "date": "2025-08-01",
    "excerpt": "Cosplay - Iron Man helmet",
    "thumbnail": "20251015_cosplay_ironman/20251014_iromman_1.jpg",
    "sections": [
      {
        "type": "header",
        "content": "Iron Man Cosplay helmet: Printing the Mark 3 Helmet"
      },
      {
        "type": "text",
        "content": [
          "Tony Stark is a extremely popular marvel character and cosplaying him for halloween or at events is a great idea.",
          "However Most people however are intimidated by the idea of making their own helment. I can help you with that,",
          "take the load of the build and produce a high quality helmet for your enjoyment.",
          "Personally I felt that building the Iron Man helmet one of the most rewarding cosplay projects.",
          "It requires patience and time but the final result is a high-quality prop.",
          "Here a walk though of taking the raw STL files, printing the pieces, and achieving that signature glossy, armored finish."
        ]
      },
      {
        "type": "header",
        "content": "1. Choosing and acquiring the designs"
      },
      {
        "type": "text",
        "content": [
          "Every great build starts with a great design. The foundational piece of this project is the 3D model, specifically the STL files.",
          "Once creator Boxandloop https://www.thingiverse.com/Boxandloop/designs has produced several highly detailed and accurate Iron Man helmet designs",
          "",
          "Boxandloop has 2 main options for creationg of Iron Man helmets:",
          " - MK3 build: https://www.thingiverse.com/thing:4629346",
          " - MK5 build: https://www.thingiverse.com/thing:5137286",
          "",
          "In this case i went with the MK3 as its more simplistic design with a single faceplate and less complex electronics.",
          "Both models are designed to be printed in multiple pieces that account for several issues that occur in 3d printing and assembly."
        ]
      },
      {
        "type": "header",
        "content": "2. The 3D Printing Process"
      },
      {
        "type": "text",
        "content": [
          "This project is a marathon, not a sprint. The helmet is large and complex, and needs to be printed in multiple sections.",
          "",
          "Slicing & Preparation",
          "- Material: PLA (Polylactic Acid) is the most common, cost effective and easiest to work with.",
          "- Nozzle Size: 0.02mm. Given that I was printing a high detail design that needs to be filled, and sanded smooth the 0.2mm nozzle will sustainably reduce my labour and keep the finer details.",
          "- Layer Height: 0.15mm. Again Finer layers will result in a smoother print and less work in post-processing, but will takes longer to print.",
          "- Infill: Standard PLA infill The helmet is strong enough to handle sanding, and light enough to wear comfortably.",
          "- Supports: Highly part dependent but in generate standard elegoo supports where used, especially for the eye openings and chin/neck areas.",
          "- Orientation: Each piece was placed vertically if possible. This again costs more print time but the goal was to minimize circles layers especially on curved surfaces that are very difficult to smooth away.",
          "",
          "Once the print parameters where chosen the printing can begin. ",
          "Given the size of the helmet and the printer bed size limitations, each piece was printed separately. ",
          "This is especially true for parts with protrusions or have complex angles as they have a higher chance of failing. ",
          "And when a single print in a batch fails the 3d printer has a tendency to corrupt the other pieces in the batch by dragging dangling filament or loose pieces into the other good pieces.",
          "Over all a batch of parts has higher chance of failure and results into a larger waste of time and material. ",
          "Its better to just cancel the print early and start over."
        ]
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251014_iromman_1.jpg",
        "caption": "Raw printed pieces straight off the printer"
      },
      {
        "type": "header",
        "content": "3. Putty Filling"
      },
      {
        "type": "text",
        "content": [
          "Most pieces in this build took around 10-16 hours each to print depending on the size and complexity. ",
          "What this means is practically each part is smoothed and primed individually while the next part is printing and the paint on a prior parts are drying",
          "Guides that tell you to print all the pieces first and then start the post processing are misleading and impractical.",
          "Forward planning and time management is key to a successful build.",
          "",
          "Once the piece is printed, the most labour intensive part of the job begins: smoothing and painting.",
          "First I use a watered down wood putty to filling in between the layer lines. ",
          "Without this step you would be sanding for hours just to get rid of the visible layer lines. ",
          "The watered down putty seeps into the layer lines and fills them in. ",
          "Let it dry completely before sanding. Generally that is at least an hour depending on the size of the piece.",
          "Keep in mind that the goal here is to get a perfectly smooth surface. ",
          "",
          "It should be noted that some people prefer to use spray on putty, ",
          "this is fine however cost performance is much much higher that watered wood putty. "
        ]
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251014_ironman_2.jpg",
        "caption": "Face plate after initial putty filling"
      },
      {
        "type": "header",
        "content": "4. First pass dry sanding"
      },
      {
        "type": "text",
        "content": [
          "Once the putty is dry sand it down.",
          "A 3 pass dry sanding was used here:",
          " - coarse 80 grit dry sanding to level the filler and remove layer line edges.",
          " - course 100 grit dry sanding pass to even the surface.",
          " - fine 120 grit dry pass smooth the surface.",
          "",
          "The objective here is to get rid of all the major imperfections and get a generally smooth surface.",
          "The putty is fraglie and can be sanded away quickly so care is take to not over sand and create new imperfections."
        ]
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251019_ironman_7.jpg",
        "caption": "Back plate after putty filling and sanding"
      },
      {
        "type": "header",
        "content": "5. Second pass primer base coat and sanding"
      },
      {
        "type": "text",
        "content": [
          "Once the putty is applied and dryed smooth the mat primer coat of paint is applied.",
          " - In this case i used a rattle can off white of arcylic Primer. ",
          " - Whatever primer you use make sure its plastic safe.",
          " - Use a dusting spray technique to build the coat otherwise you can get running and an uneven paint job.",
          " - This primer coat will help fill in any tiny imperfections you missed during sanding and lock in the putty",
          "",
          "Once the primer coat has dried for a 4-5 hours the wet sanded pass can begin.",
          "In this stage i used a 3 pass wet sanding approach:",
          " - course 200 grit wet sanding",
          " - fine 300 grit wet sanding ",
          " - fine 400 grit wet sanding ",
          "",
          "Repeat the primer and sanding passes until the surface is smooth to the touch and the individual print layers are invisible.",
          "This sanding is what makes the print lines disappear and give the mask an entirely for a metallic look."
        ]
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251014_ironman_3.jpg",
        "caption": ""
      },
      {
        "type": "header",
        "content": "6. Final paint coat"
      },
      {
        "type": "text",
        "content": [
          "Once the primer coat and wet sanding was complete and i was happy with the smoothness of the part.",
          "I applied a metallic pass. In this case i used a metallic paint with a silicon gloss layer build in.",
          "This paint can only be applied as a single final coat because the the silcon in the paint will prevent any further coats from working properly.",
          "Application is similar to the primer coat:",
          "use a dusting spray technique to build the coat otherwise and progress it until the coat binds together to from single uniform surface.",
          "This gives the part its final smooth reflective metallic look."
        ]
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251019_ironman_8.jpg",
        "caption": ""
      },
      {
        "type": "header",
        "content": "7. Rise and repeat"
      },
      {
        "type": "text",
        "content": [
          "Repeat the process over and over to perpare all the parts. This is the laborer of the build and all it takes is time."
        ]
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251016_ironman_6.jpg",
        "caption": ""
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251021_ironman_9.jpg",
        "caption": ""
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251021_ironman_10.jpg",
        "caption": ""
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251021_ironman_11.jpg",
        "caption": ""
      },
      {
        "type":  "image",
        "filename": "20251015_cosplay_ironman/20251021_ironman_12.jpg",
        "caption": ""
      },
      {
        "type": "header",
        "content": "8. Electroinics Assembly"
      },
      {
        "type": "header",
        "content": "9. Parts Assembly and Finishing"
      },
      {
        "type": "text",
        "content": [
          "So once all the pieces are printed ad painted, and the electronics are assembled. ",
          "The main assembly work begins: turning separate parts into a unified helmet.",
          "- Test Fit: Before gluing, test fit all pieces together. ",
          "- Clean imperfections with Use sandpaper or an exacto knife to that prevent a perfect join.",
          "- Predrill with a hand drill any screw holes needed for assembly.",
          "- Glue: Use a strong adhesive like super glue Glue the main helmet sections together, piece by piece. and then screw them for extra strength.",
          "- Mount Electronics: Install the servos and LED lights and any other electronics into their designated slots."
        ]
      }
    ]
  },
  {
    "id": "warhammer_kitbast_20250611",
    "title": "Warhammer 40k kit bash - Dreadnoughts",
    "date": "2025-06-11",
    "excerpt": "Warhammer 40k kit bash Dreadnoughts",
    "thumbnail": "20250611_kitbash/kitbashing_20250611_1.jpg",
    "sections": [
      {
        "type": "header",
        "content": "Warhammer 40k kit bash - Dreadnoughts"
      },
      {
        "type": "text",
        "content": "A set of grey wolf dreadnought kitbash parts. Done in grey resin"
      },
      {
        "type": "image",
        "filename": "20250611_kitbash/kitbashing_20250611_4.jpg",
        "caption": "The STL parts laided out"
      },
      {
        "type": "text",
        "content": "Once the high quaility STL has been aquired and checked we can start the printing process"
      },
      {
        "type": "image",
        "filename": "20250611_kitbash/kitbashing_20250611_5.jpg",
        "caption": "Drip drying and draining the excess resin."
      },
      {
        "type": "image",
        "filename": "20250611_kitbash/kitbashing_20250611_6.jpg",
        "caption": "UV curing the prints."
      },

      {
        "type": "text",
        "content": "Once the high quaility STL has been aquired and checked we can start the printing process"
      },
      {
        "type": "image",
        "filename": "20250611_kitbash/kitbashing_20250611_1.jpg",
        "caption": "Final Set of kit bash parts"
      },

      {
        "type": "text",
        "content": "Some images showing the up close detail that a resin print can achieve"
      },
      {
        "type": "image",
        "filename": "20250611_kitbash/kitbashing_20250611_2.jpg",
        "caption": ""
      },
      {
        "type": "image",
        "filename": "20250611_kitbash/kitbashing_20250611_3.jpg",
        "caption": ""
      },

      {
        "type": "text",
        "content": "A final look at the assembly in progress"
      },
      {
        "type": "image",
        "filename": "20250611_kitbash/kitbashing_20250611_7.jpg",
        "caption": ""
      },
      {
        "type": "image",
        "filename": "20250611_kitbash/kitbashing_20250611_8.jpg",
        "caption": ""
      }

    ]
  },
  {
    "id": "warhammer_kitbast_20250606",
    "title": "Warhammer 40k kit bash",
    "date": "2025-06-06",
    "excerpt": "Warhammer 40k kit bash guns",
    "thumbnail": "20250606_kitbash/kitbashing_20250606_1.jpg",
    "sections": [
      {
        "type": "header",
        "content": "Warhammer 40K - Kit bashing"
      },
      {
        "type": "text",
        "content": "Warhammer 40K - Kit bashing- Space Marine alternative guns. Printed in grey resin"
      },
      {
        "type": "image",
        "filename": "20250606_kitbash/kitbashing_20250606_1.jpg",
        "caption": "CAD design of the prototype"
      },
      {
        "type": "image",
        "filename": "20250606_kitbash/kitbashing_20250606_2.jpg",
        "caption": "Printed Result"
      }
    ]
  },
  {
    "id": "dnd_minis_2025_06",
    "title": "D&d mini set 2025-06",
    "date": "2025-06-25",
    "excerpt": "D&D gamers mini set",
    "thumbnail": "20250625_dnd_mini/dnd_mini_20250625_banner.jpg",
    "sections": [
      {
        "type": "header",
        "content": "D&d mini set"
      },
      {
        "type": "image",
        "filename": "20250625_dnd_mini/dnd_mini_20250625_banner.jpg",
        "caption": "Hero mini - goblin archer squad"
      },
      {
        "type": "text",
        "content": "This set of minis was done in elegoo grey resin and base coated with vallejo black base paint."
      },
      {
        "type": "subheader",
        "content": "Hero Squad samples"
      },
      {
        "type": "image",
        "filename": "20250625_dnd_mini/dnd_mini_20250625_1.jpg",
        "caption": "Hero mini - Teifling cleric"
      },
      {
        "type": "image",
        "filename": "20250625_dnd_mini/dnd_mini_20250625_3.jpg",
        "caption": "Hero mini - Dragonborn paladin"
      },
      {
        "type": "image",
        "filename": "20250625_dnd_mini/dnd_mini_20250625_4.jpg",
        "caption": "Hero mini - Orc barbarian"
      },
      {
        "type": "subheader",
        "content": "Goblin squad samples"
      },
      {
        "type": "image",
        "filename": "20250625_dnd_mini/dnd_mini_20250625_2.jpg",
        "caption": "Goblin mini - Solider"
      },
      {
        "type": "image",
        "filename": "20250625_dnd_mini/dnd_mini_20250625_5.jpg",
        "caption": "Hero mini - Darts man"
      },
      {
        "type": "image",
        "filename": "20250625_dnd_mini/dnd_mini_20250625_6.jpg",
        "caption": "Hero mini - archer"
      }
    ]
  }
]